package com._01_MySQL概念;


// 数据库的三层结构
//
// 1.相关术语
//  DBMS，数据库管理系统 -- database management system
//  DB，数据库
//
//
// 2.三层结构
//  安装MySQL数据库，就是在主机中安装一个DBMS（数据库管理系统），
//  一个DBMS可以管理多个DB（数据库），
//  一个DB中可以创建多个表，用于保存数据信息。
//  注意：
//      ①数据库的本质是文件夹
//      ②普通的表的本质是文件
//
//
// 3.数据在DB中的存储方式
//  数据主要以“表”的方式存储在数据库中
//  表的一行称之为一条记录（元组） -> 在java程序中往往用一个对象表示
//
//
// 4.SQL语句分类
//  ①数据定义语言[create表]
//  ②数据操作语言[增insert,删delete,改update]
//  ③数据查询语言[select]
//  ④数据控制语言[管理数据库]


public class _01_MySQL三层结构 {
}
