package com.leetcode_2024_03_06.test1;


//    TODO 2917. 找出数组中的 K-or 值
//
//    给你一个下标从 0 开始的整数数组 nums 和一个整数 k 。
//    nums 中的 K-or 是一个满足以下条件的非负整数：
//    只有在 nums 中，至少存在 k 个元素的第 i 位值为 1 ，那么 K-or 中的第 i 位的值才是 1 。
//    返回 nums 的 K-or 值。
//    注意 ：对于整数 x ，如果 (2i AND x) == 2i ，则 x 中的第 i 位值为 1 ，其中 AND 为按位与运算符。
//
//
//    示例 1：
//    输入：nums = [7,12,9,8,9,15], k = 4
//    输出：9
//    解释：nums[0]、nums[2]、nums[4] 和 nums[5] 的第 0 位的值为 1 。
//    nums[0] 和 nums[5] 的第 1 位的值为 1 。
//    nums[0]、nums[1] 和 nums[5] 的第 2 位的值为 1 。
//    nums[1]、nums[2]、nums[3]、nums[4] 和 nums[5] 的第 3 位的值为 1 。
//    只有第 0 位和第 3 位满足数组中至少存在 k 个元素在对应位上的值为 1 。因此，答案为 2^0 + 2^3 = 9 。
//
//    示例 2：
//    输入：nums = [2,12,1,11,4,5], k = 6
//    输出：0
//    解释：因为 k == 6 == nums.length ，所以数组的 6-or 等于其中所有元素按位与运算的结果。因此，答案为 2 AND 12 AND 1 AND 11 AND 4 AND 5 = 0 。
//
//    示例 3：
//    输入：nums = [10,8,5,9,11,6,8], k = 1
//    输出：15
//    解释：因为 k == 1 ，数组的 1-or 等于其中所有元素按位或运算的结果。因此，答案为 10 OR 8 OR 5 OR 9 OR 11 OR 6 OR 8 = 15 。
//
//
//    提示：
//    1 <= nums.length <= 50
//    0 <= nums[i] < 231
//    1 <= k <= nums.length


public class Test {
    public static void main(String[] args) {
        Solution solution = new Solution();

        int[] arr1 = {7, 12, 9, 8, 9, 15};
        System.out.println(solution.findKOr(arr1, 4));// 9

        int[] arr2 = {2, 12, 1, 11, 4, 5};
        System.out.println(solution.findKOr(arr2, 6));// 0

        int[] arr3 = {10, 8, 5, 9, 11, 6, 8};
        System.out.println(solution.findKOr(arr3, 1));// 15

        int[] arr4 = {925011496, 103855710, 1584980217, 1804943441, 904176743, 71227402, 658339386, 1949490684, 394057351, 1504638274, 936036729, 516283059, 995417756, 1370320334, 1501991237, 578607899, 981063549, 1950398619, 780236107, 258555692, 2055224506, 521917008, 1643308943, 522924296, 1115988653, 136177651, 2112081121, 1411190147, 1059197244, 1476196073, 1563551833, 477789887, 1901104327, 752532861, 824056222};
        System.out.println(solution.findKOr(arr4, 16));// 1065156095
    }
}
